# Predicting Customer Credit Default

#identify which customer attributes relate significantly to customer default #rates and to build a predictive model #that Credit One can use to better #classify potential customers as being ‘at-risk’, compared to previously #implemented models. We will use machine learning regression methods in #Python for this task.

# Attribute Information:

#This research employed a binary variable, default payment (Yes = 1, No = 0), as the response variable. This study #reviewed the literature and used the following 23 variables as explanatory variables:
#X1: Amount of the given credit (NT dollar): it includes both the individual consumer credit and his/her family ####(supplementary) credit.
#X2: Gender (1 = male; 2 = female).
#X3: Education (1 = graduate school; 2 = university; 3 = high school; 0, 4, 5, 6 = others). X4: Marital status (1 = #married; 2 = single; 3 = divorce; 0=others).
#X5: Age (year).
#X6 - X11: History of past payment. We tracked the past monthly payment records (from April to September, 2005) as #follows: X6 = the repayment status in September, 2005; X7 = the repayment status in August, 2005; . . .;X11 = the #repayment status in April, 2005.
#The measurement scale for the repayment status is:
#-2: No consumption; -1: Paid in full; 0: The use of revolving credit; 1 = payment delay for one month; 2 = payment #delay for two months; . . .; 8 = payment delay for eight months; 9 = payment delay for nine months and above.
#X12-X17: Amount of bill statement (NT dollar). X12 = amount of bill statement in September, 2005; X13 = amount of #bill statement in August, 2005; . . .; X17 = amount of bill statement in April, 2005.
#X18-X23: Amount of previous payment (NT dollar). X18 = amount paid in September, 2005; X19 = amount paid in #August, 2005; . . .;X23 = amount paid in April, 2005.
#Y: client's behavior; Y=0 then not default, Y=1 then default"

# Import Packages

In [1]:
# DS Basics
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#import pandas_profiling
import seaborn as sns

# SKLearn Stuff
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, classification_report
from sklearn.ensemble import RandomForestClassifier, GradientBoostingClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import KFold

# helpers
%matplotlib inline

# Grahpviz
#from sklearn.externals.six import StringIO
from IPython.display import Image
from sklearn.tree import export_graphviz
import pydotplus
import graphviz

In [2]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

In [3]:
db_connection_str = 'mysql+pymysql://deepanalytics:Sqltask1234!@34.73.222.197/deepanalytics'

In [4]:
db_connection = create_engine(db_connection_str)

In [5]:
df = pd.read_sql('SELECT * FROM credit', con=db_connection)

In [6]:
#1
df.head(5)

,MyUnknownColumn,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
1,1,20000,female,university,1,24,2,2,-1,-1,...,0,0,0,0,689,0,0,0,0,default
2,2,120000,female,university,2,26,-1,2,0,0,...,3272,3455,3261,0,1000,1000,1000,0,2000,default
3,3,90000,female,university,2,34,0,0,0,0,...,14331,14948,15549,1518,1500,1000,1000,1000,5000,not default
4,4,50000,female,university,1,37,0,0,0,0,...,28314,28959,29547,2000,2019,1200,1100,1069,1000,not default

In [7]:
#write to csv
df.to_csv('credit1_extract_data_out.csv')

In [8]:
df.dtypes

MyUnknownColumn    object
X1                 object
X2                 object
X3                 object
X4                 object
X5                 object
X6                 object
X7                 object
X8                 object
X9                 object
X10                object
X11                object
X12                object
X13                object
X14                object
X15                object
X16                object
X17                object
X18                object
X19                object
X20                object
X21                object
X22                object
X23                object
Y                  object
dtype: object

In [9]:
#2#delete the header row and make the first row the new header row
new_header = df.iloc[0]
df = df[0:]
df.columns = new_header

In [10]:
#3# sorting data frame by name 
df = df.sort_values('AGE', ascending = False)
#disply data
df.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
202,,X1,X2,X3,X4,X5,X6,X7,X8,X9,...,X15,X16,X17,X18,X19,X20,X21,X22,X23,Y
0,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
203,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
18449,18246,440000,male,graduate school,1,79,0,0,0,0,...,447112,438187,447543,15715,16519,16513,15800,16531,15677,not default
450,247,250000,female,university,1,75,0,-1,-1,-1,...,1010,5572,794,1631,1536,1010,5572,794,1184,not default

# 4#Select only desired rows and columns

In [11]:
credit=df.iloc[3:30205, 1:25] 
credit.reset_index(drop=True, inplace=True)
credit.head()

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,440000,male,graduate school,1,79,0,0,0,0,0,...,447112,438187,447543,15715,16519,16513,15800,16531,15677,not default
1,250000,female,university,1,75,0,-1,-1,-1,-1,...,1010,5572,794,1631,1536,1010,5572,794,1184,not default
2,180000,male,graduate school,1,75,1,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,default
3,210000,male,university,1,75,0,0,0,0,0,...,203776,205901,210006,9700,8810,9000,7300,7500,7600,not default
4,160000,female,high school,1,74,0,0,0,-1,-1,...,16905,0,19789,3783,2268,16905,0,19789,26442,not default

# 5 Drop Duplicates

In [12]:
#Remove null values
credit.dropna(inplace=True)

In [13]:
#5#code the df with NaN values for missing or ‘?’
credit.replace([' ','?'], np.nan)
credit

,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,PAY_5,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default payment next month
0,440000,male,graduate school,1,79,0,0,0,0,0,...,447112,438187,447543,15715,16519,16513,15800,16531,15677,not default
1,250000,female,university,1,75,0,-1,-1,-1,-1,...,1010,5572,794,1631,1536,1010,5572,794,1184,not default
2,180000,male,graduate school,1,75,1,-2,-2,-2,-2,...,0,0,0,0,0,0,0,0,0,default
3,210000,male,university,1,75,0,0,0,0,0,...,203776,205901,210006,9700,8810,9000,7300,7500,7600,not default
4,160000,female,high school,1,74,0,0,0,-1,-1,...,16905,0,19789,3783,2268,16905,0,19789,26442,not default
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
30196,10000,male,university,2,21,0,0,0,0,-1,...,9393,4176,0,2000,1000,188,2538,0,0,not default
30197,10000,female,graduate school,2,21,0,0,0,2,0,...,9699,9699,0,1304,2500,6,0,0,0,not default
30198,20000,female,university,2,21,0,0,0,-2,-2,...,0,0,0,1005,0,0,0,0,0,not default
30199,20000,female,university,2,21,0,0,0,0,0,...,4725,9135,18355,3000,2000,1200,5000,10000,8906,not default
30200,30000,female,university,2,21,-1,-1,0,0,-1,...,3562,1621,1307,20002,1101,1,1724,1408,0,not default

In [14]:
#6#Drop Duplicates
credit.drop_duplicates(keep=False,inplace=True)
print(credit.duplicated().sum())

0

# Change Data Types

In [15]:
#7
credit['LIMIT_BAL'] = (credit['LIMIT_BAL'] == 1).astype('int')
credit['MARRIAGE'] = (credit['MARRIAGE'] == 1).astype('int')
credit['AGE'] = (credit['AGE'] == 1).astype('int')
credit['PAY_0'] = (credit['PAY_0'] == 1).astype('int')
credit['PAY_2'] = (credit['PAY_2'] == 1).astype('int')
credit['PAY_3'] = (credit['PAY_3'] == 1).astype('int')
credit['PAY_4'] = (credit['PAY_4'] == 1).astype('int')
credit['PAY_5'] = (credit['PAY_5'] == 1).astype('int')
credit['PAY_6'] = (credit['PAY_6'] == 1).astype('int')
credit['BILL_AMT1'] = (credit['BILL_AMT1'] == 1).astype('int')
credit['BILL_AMT2'] = (credit['BILL_AMT2'] == 1).astype('int')
credit['BILL_AMT3'] = (credit['BILL_AMT3'] == 1).astype('int')
credit['BILL_AMT4'] = (credit['BILL_AMT4'] == 1).astype('int')
credit['BILL_AMT5'] = (credit['BILL_AMT5'] == 1).astype('int')
credit['BILL_AMT6'] = (credit['BILL_AMT6'] == 1).astype('int')
credit['PAY_AMT1'] = (credit['PAY_AMT1'] == 1).astype('int')
credit['PAY_AMT2'] = (credit['PAY_AMT2'] == 1).astype('int')
credit['PAY_AMT3'] = (credit['PAY_AMT3'] == 1).astype('int')
credit['PAY_AMT4'] = (credit['PAY_AMT4'] == 1).astype('int')
credit['PAY_AMT5'] = (credit['PAY_AMT5'] == 1).astype('int')
credit['PAY_AMT6'] = (credit['PAY_AMT6'] == 1).astype('int')
credit['PAY_AMT6'] = (credit['PAY_AMT6'] == 1).astype('int')
credit.dtypes

0
LIMIT_BAL                      int64
SEX                           object
EDUCATION                     object
MARRIAGE                       int64
AGE                            int64
PAY_0                          int64
PAY_2                          int64
PAY_3                          int64
PAY_4                          int64
PAY_5                          int64
PAY_6                          int64
BILL_AMT1                      int64
BILL_AMT2                      int64
BILL_AMT3                      int64
BILL_AMT4                      int64
BILL_AMT5                      int64
BILL_AMT6                      int64
PAY_AMT1                       int64
PAY_AMT2                       int64
PAY_AMT3                       int64
PAY_AMT4                       int64
PAY_AMT5                       int64
PAY_AMT6                       int64
default payment next month    object
dtype: object